[
    {
        "id": "tt0468569",
        "name": "The Dark Knight",
        "plot": "When the menace known as the Joker wreaks havoc and chaos on the people of Gotham, Batman must accept one of the greatest psychological and physical tests of his ability to fight injustice.",
        "year": "2008"
    },
    {
        "id": "tt0038650",
        "name": "It's a Wonderful Life",
        "plot": "An angel is sent from Heaven to help a desperately frustrated businessman by showing him what life would have been like if he had never existed.",
        "year": "1946"
    },
    {
        "id": "tt7466810",
        "name": "777 Charlie",
        "plot": "Dharma is stuck in a rut with his negative and lonely lifestyle and spends each day in the comfort of his loneliness. A pup named Charlie enters his life and gives him a new perspective towards it.",
        "year": "2022"
    },
    {
        "id": "tt0110357",
        "name": "The Lion King",
        "plot": "Lion prince Simba and his father are targeted by his bitter uncle, who wants to ascend the throne himself.",
        "year": "1994"
    },
    {
        "id": "tt0109830",
        "name": "Forrest Gump",
        "plot": "The history of the United States from the 1950s to the '70s unfolds from the perspective of an Alabama man with an IQ of 75, who yearns to be reunited with his childhood sweetheart.",
        "year": "1994"
    },
    {
        "id": "tt0108052",
        "name": "Schindler's List",
        "plot": "In German-occupied Poland during World War II, industrialist Oskar Schindler gradually becomes concerned for his Jewish workforce after witnessing their persecution by the Nazis.",
        "year": "1993"
    },
    {
        "id": "tt5074352",
        "name": "Dangal",
        "plot": "Former wrestler Mahavir Singh Phogat and his two wrestler daughters struggle towards glory at the Commonwealth Games in the face of societal oppression.",
        "year": "2016"
    },
    {
        "id": "tt15398776",
        "name": "Oppenheimer",
        "plot": "The story of American scientist J. Robert Oppenheimer and his role in the development of the atomic bomb.",
        "year": "2023"
    },
    {
        "id": "tt0167260",
        "name": "The Lord of the Rings: The Return of the King",
        "plot": "Gandalf and Aragorn lead the World of Men against Sauron's army to draw his gaze from Frodo and Sam as they approach Mount Doom with the One Ring.",
        "year": "2003"
    },
    {
        "id": "tt9362722",
        "name": "Spider-man: Across the Spider-verse",
        "plot": "Miles Morales catapults across the multiverse, where he encounters a team of Spider-People charged with protecting its very existence. When the heroes clash on how to handle a new threat, Miles must redefine what it means to be a hero.",
        "year": "2023"
    },
    {
        "id": "tt0118799",
        "name": "Life Is Beautiful",
        "plot": "When an open-minded Jewish waiter and his son become victims of the Holocaust, he uses a perfect mixture of will, humor and imagination to protect his son from the dangers around their camp.",
        "year": "1997"
    },
    {
        "id": "tt8503618",
        "name": "Hamilton",
        "plot": "The real life of one of America's foremost founding fathers and first Secretary of the Treasury, Alexander Hamilton. Captured live on Broadway from the Richard Rodgers Theater with the original Broadway cast.",
        "year": "2020"
    },
    {
        "id": "tt1375666",
        "name": "Inception",
        "plot": "A thief who steals corporate secrets through the use of dream-sharing technology is given the inverse task of planting an idea into the mind of a C.E.O., but his tragic past may doom the project and his team to disaster.",
        "year": "2010"
    },
    {
        "id": "tt0118849",
        "name": "Bacheha-Ye Aseman",
        "plot": "After a boy loses his sister's pair of shoes, he goes on a series of adventures in order to find them. When he can't, he tries a new way to \"win\" a new pair.",
        "year": "1997"
    },
    {
        "id": "tt0120737",
        "name": "The Lord of the Rings: The Fellowship of the Ring",
        "plot": "A meek Hobbit from the Shire and eight companions set out on a journey to destroy the powerful One Ring and save Middle-earth from the Dark Lord Sauron.",
        "year": "2001"
    },
    {
        "id": "tt10280296",
        "name": "Sardar Udham",
        "plot": "A biopic detailing the 2 decades that Punjabi Sikh revolutionary, Udham Singh, spent planning the assassination of the man responsible for the Jallianwala Bagh massacre.",
        "year": "2021"
    },
    {
        "id": "tt0245429",
        "name": "Spirited Away",
        "plot": "During her family's move to the suburbs, a sullen 10-year-old girl wanders into a world ruled by gods, witches and spirits, a world where humans are changed into beasts.",
        "year": "2001"
    },
    {
        "id": "tt0088763",
        "name": "Back to the Future",
        "plot": "Marty McFly, a 17-year-old high school student, is accidentally sent 30 years into the past in a time-traveling DeLorean invented by his close friend, the maverick scientist Doc Brown.",
        "year": "1985"
    },
    {
        "id": "tt0045152",
        "name": "Singin' in the Rain",
        "plot": "A silent film star falls for a chorus girl just as he and his delusionally jealous screen partner are trying to make the difficult transition to talking pictures in 1920s Hollywood.",
        "year": "1952"
    },
    {
        "id": "tt2356180",
        "name": "Bhaag Milkha Bhaag",
        "plot": "The truth behind the ascension of Milkha Singh, who was scarred by of the India-Pakistan partition.",
        "year": "2013"
    },
    {
        "id": "tt0114369",
        "name": "Se7en",
        "plot": "Two detectives, a rookie and a veteran, hunt a serial killer who uses the seven deadly sins as his motives.",
        "year": "1995"
    },
    {
        "id": "tt0112573",
        "name": "Braveheart",
        "plot": "Scottish warrior William Wallace leads his countrymen in a rebellion to free his homeland from the tyranny of King Edward I of England.",
        "year": "1995"
    },
    {
        "id": "tt1675434",
        "name": "Intouchables",
        "plot": "After he becomes a quadriplegic from a paragliding accident, an aristocrat hires a young man from the projects to be his caregiver.",
        "year": "2011"
    },
    {
        "id": "tt20850406",
        "name": "Sita Ramam",
        "plot": "An orphan soldier, Lieutenant Ram's life changes, after he gets a letter from a girl named Sita. He meets her and love blossoms between them. When he comes back to his camp in Kashmir,After he gets caught in jail, he sends a letter to Sita which won't reach her.",
        "year": "2022"
    },
    {
        "id": "tt0102926",
        "name": "The Silence of the Lambs",
        "plot": "A young F.B.I. cadet must receive the help of an incarcerated and manipulative cannibal killer to help catch another serial killer, a madman who skins his victims.",
        "year": "1991"
    },
    {
        "id": "tt1620933",
        "name": "Paan Singh Tomar",
        "plot": "The story of Paan Singh Tomar, an Indian athlete and seven-time national steeplechase champion who becomes one of the most feared dacoits in Chambal Valley after his retirement.",
        "year": "2012"
    },
    {
        "id": "tt0367110",
        "name": "Swades: We, the People",
        "plot": "A successful Indian scientist returns to an Indian village to take his nanny to America with him and in the process rediscovers his roots.",
        "year": "2004"
    },
    {
        "id": "tt0167261",
        "name": "The Lord of the Rings: The Two Towers",
        "plot": "While Frodo and Sam edge closer to Mordor with the help of the shifty Gollum, the divided fellowship makes a stand against Sauron's new ally, Saruman, and his hordes of Isengard.",
        "year": "2002"
    },
    {
        "id": "tt0034583",
        "name": "Casablanca",
        "plot": "A cynical expatriate American cafe owner struggles to decide whether or not to help his former lover and her fugitive husband escape the Nazis in French Morocco.",
        "year": "1942"
    },
    {
        "id": "tt0027977",
        "name": "Modern Times",
        "plot": "The Tramp struggles to live in modern industrial society with the help of a young homeless woman.",
        "year": "1936"
    },
    {
        "id": "tt4633694",
        "name": "Spider-Man: Into the Spider-Verse",
        "plot": "Teen Miles Morales becomes the Spider-Man of his universe and must join with five spider-powered individuals from other dimensions to stop a threat for all realities.",
        "year": "2018"
    },
    {
        "id": "tt1562872",
        "name": "Zindagi Na Milegi Dobara",
        "plot": "Three friends decide to turn their fantasy vacation into reality after one of their friends gets engaged.",
        "year": "2011"
    },
    {
        "id": "tt0133093",
        "name": "The Matrix",
        "plot": "When a beautiful stranger leads computer hacker Neo to a forbidding underworld, he discovers the shocking truth--the life he knows is the elaborate deception of an evil cyber-intelligence.",
        "year": "1999"
    },
    {
        "id": "tt6751668",
        "name": "Parasite",
        "plot": "Greed and class discrimination threaten the newly formed symbiotic relationship between the wealthy Park family and the destitute Kim clan.",
        "year": "2019"
    },
    {
        "id": "tt1950186",
        "name": "Ford v. Ferrari",
        "plot": "American car designer Carroll Shelby and driver Ken Miles battle corporate interference and the laws of physics to build a revolutionary race car for Ford in order to defeat Ferrari at the 24 Hours of Le Mans in 1966.",
        "year": "2019"
    },
    {
        "id": "tt6316138",
        "name": "Ayla: The Daughter of War",
        "plot": "Sergeant Süleyman finds a little girl on a battlefield during the Korean War. He takes her and names her Ayla. Fifteen months later, Süleyman's brigade is told they will be returning to Turkey, and he is reluctant to leave her behind.",
        "year": "2017"
    },
    {
        "id": "tt0095765",
        "name": "Cinema Paradiso",
        "plot": "A filmmaker recalls his childhood when falling in love with the pictures at the cinema of his home village and forms a deep friendship with the cinema's projectionist.",
        "year": "1988"
    },
    {
        "id": "tt2380307",
        "name": "Coco",
        "plot": "Aspiring musician Miguel, confronted with his family's ancestral ban on music, enters the Land of the Dead to find his great-great-grandfather, a legendary singer.",
        "year": "2017"
    },
    {
        "id": "tt0021749",
        "name": "City Lights",
        "plot": "With the aid of a wealthy erratic tippler, a dewy-eyed tramp who has fallen in love with a sightless flower girl accumulates money to be able to help her medically.",
        "year": "1931"
    },
    {
        "id": "tt0075148",
        "name": "Rocky",
        "plot": "A small-time Philadelphia boxer gets a supremely rare chance to fight the world heavyweight champion in a bout in which he strives to go the distance for his self-respect.",
        "year": "1976"
    },
    {
        "id": "tt0059742",
        "name": "The Sound of Music",
        "plot": "A young novice is sent by her convent in 1930s Austria to become a governess to the seven children of a widowed naval officer.",
        "year": "1965"
    },
    {
        "id": "tt0080684",
        "name": "Star Wars: Episode V - The Empire Strikes Back",
        "plot": "After the Rebels are overpowered by the Empire, Luke Skywalker begins his Jedi training with Yoda, while his friends are pursued across the galaxy by Darth Vader and bounty hunter Boba Fett.",
        "year": "1980"
    },
    {
        "id": "tt0407887",
        "name": "The Departed",
        "plot": "An undercover cop and a mole in the police attempt to identify each other while infiltrating an Irish gang in South Boston.",
        "year": "2006"
    },
    {
        "id": "tt0057115",
        "name": "The Great Escape",
        "plot": "Allied prisoners of war plan for several hundred of their number to escape from a German camp during World War II.",
        "year": "1963"
    },
    {
        "id": "tt0910970",
        "name": "WALL·E",
        "plot": "In the distant future, a small waste-collecting robot inadvertently embarks on a space journey that will ultimately decide the fate of mankind.",
        "year": "2008"
    },
    {
        "id": "tt0110413",
        "name": "Léon",
        "plot": "12-year-old Mathilda is reluctantly taken in by Léon, a professional assassin, after her family is murdered. An unusual relationship forms as she becomes his protégée and learns the assassin's trade.",
        "year": "1994"
    },
    {
        "id": "tt0363163",
        "name": "Der Untergang",
        "plot": "Traudl Junge, the final secretary for Adolf Hitler, tells of the Nazi dictator's final days in his Berlin bunker at the end of WWII.",
        "year": "2004"
    },
    {
        "id": "tt0032138",
        "name": "The Wizard of Oz",
        "plot": "Young Dorothy Gale and her dog Toto are swept away by a tornado from their Kansas farm to the magical Land of Oz, and embark on a quest with three new friends to see the Wizard, who can return her to her home and fulfill the others' wishes.",
        "year": "1939"
    },
    {
        "id": "tt10189514",
        "name": "Soorarai Pottru",
        "plot": "Nedumaaran Rajangam \"Maara\" sets out to make the common man fly and in the process takes on the world's most capital intensive industry and several enemies who stand in his way.",
        "year": "2020"
    },
    {
        "id": "tt1979320",
        "name": "Rush",
        "plot": "The merciless 1970s rivalry between Formula One rivals James Hunt and Niki Lauda.",
        "year": "2013"
    },
    {
        "id": "tt0114709",
        "name": "Toy Story",
        "plot": "A cowboy doll is profoundly threatened and jealous when a new spaceman action figure supplants him as top toy in a boy's bedroom.",
        "year": "1995"
    },
    {
        "id": "tt1187043",
        "name": "3 Idiots",
        "plot": "Two friends are searching for their long lost companion. They revisit their college days and recall the memories of their friend who inspired them to think differently, even as the rest of the world called them \"idiots\".",
        "year": "2009"
    },
    {
        "id": "tt8291224",
        "name": "Uri: The Surgical Strike",
        "plot": "Indian army special forces execute a covert operation, avenging the killing of fellow army men at their base by a terrorist group.",
        "year": "2019"
    },
    {
        "id": "tt1291584",
        "name": "Warrior",
        "plot": "The youngest son of an alcoholic former boxer returns home, where he's trained by his father for competition in a mixed martial arts tournament - a path that puts the fighter on a collision course with his estranged, older brother.",
        "year": "2011"
    },
    {
        "id": "tt0073707",
        "name": "Sholay",
        "plot": "After his family is murdered by a notorious and ruthless bandit, a former police officer enlists the services of two outlaws to capture the bandit.",
        "year": "1975"
    },
    {
        "id": "tt1049413",
        "name": "Up",
        "plot": "78-year-old Carl Fredricksen travels to Paradise Falls in his house equipped with balloons, inadvertently taking a young stowaway.",
        "year": "2009"
    },
    {
        "id": "tt0482571",
        "name": "The Prestige",
        "plot": "After a tragic accident, two stage magicians in 1890s London engage in a battle to create the ultimate illusion while sacrificing everything they have to outwit each other.",
        "year": "2006"
    },
    {
        "id": "tt0057012",
        "name": "Dr. Strangelove or: How I Learned to Stop Worrying and Love the Bomb",
        "plot": "An insane American general orders a bombing attack on the Soviet Union, triggering a path to nuclear holocaust that a war room full of politicians and generals frantically tries to stop.",
        "year": "1964"
    },
    {
        "id": "tt7019842",
        "name": "96",
        "plot": "Two high school sweethearts meet at a reunion after 22 years and reminisce about their past.",
        "year": "2018"
    },
    {
        "id": "tt2119532",
        "name": "Hacksaw Ridge",
        "plot": "World War II American Army Medic Desmond T. Doss, serving during the Battle of Okinawa, refuses to kill people and becomes the first man in American history to receive the Medal of Honor without firing a shot.",
        "year": "2016"
    },
    {
        "id": "tt0081398",
        "name": "Raging Bull",
        "plot": "The life of boxer Jake LaMotta, whose violence and temper that led him to the top in the ring destroyed his life outside of it.",
        "year": "1980"
    },
    {
        "id": "tt0435761",
        "name": "Toy Story 3",
        "plot": "The toys are mistakenly delivered to a day-care center instead of the attic right before Andy leaves for college, and it's up to Woody to convince the other toys that they weren't abandoned and to return home.",
        "year": "2010"
    },
    {
        "id": "tt0114814",
        "name": "The Usual Suspects",
        "plot": "The sole survivor of a pier shoot-out tells the story of how a notorious criminal influenced the events that began with five criminals meeting in a seemingly random police lineup.",
        "year": "1995"
    },
    {
        "id": "tt0169102",
        "name": "Lagaan: Once Upon a Time in India",
        "plot": "The people of a small village in Victorian India stake their future on a game of cricket against their ruthless British rulers.",
        "year": "2001"
    },
    {
        "id": "tt0076759",
        "name": "Star Wars: Episode IV - A New Hope",
        "plot": "Luke Skywalker joins forces with a Jedi Knight, a cocky pilot, a Wookiee and two droids to save the galaxy from the Empire's world-destroying battle station, while also attempting to rescue Princess Leia from the mysterious Darth Vader.",
        "year": "1977"
    },
    {
        "id": "tt0032553",
        "name": "The Great Dictator",
        "plot": "Dictator Adenoid Hynkel tries to expand his empire while a poor Jewish barber tries to avoid persecution from Hynkel's regime.",
        "year": "1940"
    },
    {
        "id": "tt2024544",
        "name": "12 Years a Slave",
        "plot": "In the antebellum United States, Solomon Northup, a free black man from upstate New York, is abducted and sold into slavery.",
        "year": "2013"
    },
    {
        "id": "tt0405159",
        "name": "Million Dollar Baby",
        "plot": "Frankie, an ill-tempered old coach, reluctantly agrees to train aspiring boxer Maggie. Impressed with her determination and talent, he helps her become the best and the two soon form a close bond.",
        "year": "2004"
    },
    {
        "id": "tt5311514",
        "name": "Kimi No Na Wa.",
        "plot": "Two teenagers share a profound, magical connection upon discovering they are swapping bodies. Things manage to become even more complicated when the boy and girl decide to meet in person.",
        "year": "2016"
    },
    {
        "id": "tt0047396",
        "name": "Rear Window",
        "plot": "A photographer in a wheelchair spies on his neighbors from his Greenwich Village courtyard apartment window, and becomes convinced one of them has committed murder, despite the skepticism of his fashion-model girlfriend.",
        "year": "1954"
    },
    {
        "id": "tt0066763",
        "name": "Anand",
        "plot": "The story of a terminally ill man who wishes to live life to the fullest before the inevitable occurs, as told by his best friend.",
        "year": "1971"
    },
    {
        "id": "tt0986264",
        "name": "Taare Zameen Par",
        "plot": "An eight-year-old boy is thought to be a lazy trouble-maker, until the new art teacher has the patience and compassion to discover the real problem behind his struggles in school.",
        "year": "2007"
    },
    {
        "id": "tt0103064",
        "name": "Terminator 2: Judgment Day",
        "plot": "A cyborg, identical to the one who failed to kill Sarah Connor, must now protect her ten year old son John from an even more advanced and powerful cyborg.",
        "year": "1991"
    },
    {
        "id": "tt0119217",
        "name": "Good Will Hunting",
        "plot": "Will Hunting, a janitor at M.I.T., has a gift for mathematics, but needs help from a psychologist to find direction in his life.",
        "year": "1997"
    },
    {
        "id": "tt3783958",
        "name": "La La Land",
        "plot": "While navigating their careers in Los Angeles, a pianist and an actress fall in love while attempting to reconcile their aspirations for the future.",
        "year": "2016"
    },
    {
        "id": "tt0054215",
        "name": "Psycho",
        "plot": "A Phoenix secretary embezzles $40,000 from her employer's client, goes on the run and checks into a remote motel run by a young man under the domination of his mother.",
        "year": "1960"
    },
    {
        "id": "tt0395169",
        "name": "Hotel Rwanda",
        "plot": "Paul Rusesabagina, a hotel manager, houses over a thousand Tutsi refugees during their struggle against the Hutu militia in Rwanda, Africa.",
        "year": "2004"
    },
    {
        "id": "tt4729430",
        "name": "Klaus",
        "plot": "A simple act of kindness always sparks another, even in a frozen, faraway place. When Smeerensburg's new postman, Jesper, befriends toymaker Klaus, their gifts melt an age-old feud and deliver a sleigh full of holiday traditions.",
        "year": "2019"
    },
    {
        "id": "tt0047478",
        "name": "Shichinin No Samurai",
        "plot": "Farmers from a village exploited by bandits hire a veteran samurai for protection, who gathers six other samurai to join him.",
        "year": "1954"
    },
    {
        "id": "tt0338013",
        "name": "Eternal Sunshine of the Spotless Mind",
        "plot": "When their relationship turns sour, a couple undergoes a medical procedure to have each other erased from their memories for ever.",
        "year": "2004"
    },
    {
        "id": "tt0053604",
        "name": "The Apartment",
        "plot": "A Manhattan insurance clerk tries to rise in his company by letting its executives use his apartment for trysts, but complications and a romance of his own ensue.",
        "year": "1960"
    },
    {
        "id": "tt0871510",
        "name": "Chak De! India",
        "plot": "Kabir Khan, the coach of the Indian Women's National Hockey Team, dreams of making his all-girls team emerge victorious against all odds.",
        "year": "2007"
    },
    {
        "id": "tt0364569",
        "name": "Oldeuboi",
        "plot": "After being kidnapped and imprisoned for fifteen years, Oh Dae-Su is released, only to find that he must find his captor in five days.",
        "year": "2003"
    },
    {
        "id": "tt0101414",
        "name": "Beauty and the Beast",
        "plot": "A prince cursed to spend his days as a hideous monster sets out to regain his humanity by earning a young woman's love.",
        "year": "1991"
    },
    {
        "id": "tt0074896",
        "name": "Mohammed Messenger of God",
        "plot": "This epic historical drama chronicles the life and times of Prophet Muhammad and serves as an introduction to early Islamic history.",
        "year": "1976"
    },
    {
        "id": "tt0347149",
        "name": "Hauru No Ugoku Shiro",
        "plot": "When an unconfident young woman is cursed with an old body by a spiteful witch, her only chance of breaking the spell lies with a self-indulgent yet insecure young wizard and his companions in his legged, walking castle.",
        "year": "2004"
    },
    {
        "id": "tt0052357",
        "name": "Vertigo",
        "plot": "A former San Francisco police detective juggles wrestling with his personal demons and becoming obsessed with the hauntingly beautiful woman he has been hired to trail, who may be deeply disturbed.",
        "year": "1958"
    },
    {
        "id": "tt0056058",
        "name": "Seppuku",
        "plot": "When a ronin requesting seppuku at a feudal lord's palace is told of the brutal suicide of another ronin who previously visited, he reveals how their pasts are intertwined - and in doing so challenges the clan's integrity.",
        "year": "1962"
    },
    {
        "id": "tt0352248",
        "name": "Cinderella Man",
        "plot": "The story of James J. Braddock, a supposedly washed-up boxer who came back to challenge for the heavyweight championship of the world.",
        "year": "2005"
    },
    {
        "id": "tt0103639",
        "name": "Aladdin",
        "plot": "A kind-hearted street urchin and a power-hungry Grand Vizier vie for a magic lamp that has the power to make their deepest wishes come true.",
        "year": "1992"
    },
    {
        "id": "tt7286456",
        "name": "Joker",
        "plot": "During the 1980s, a failed stand-up comedian is driven insane and turns to a life of crime and chaos in Gotham City while becoming an infamous psychopathic crime figure.",
        "year": "2019"
    },
    {
        "id": "tt0060107",
        "name": "Andrei Rublev",
        "plot": "The life, times and afflictions of the fifteenth-century Russian iconographer St. Andrei Rublev.",
        "year": "1966"
    },
    {
        "id": "tt0266543",
        "name": "Finding Nemo",
        "plot": "After his son is captured in the Great Barrier Reef and taken to Sydney, a timid clownfish sets out on a journey to bring him home.",
        "year": "2003"
    },
    {
        "id": "tt0211915",
        "name": "Le fabuleux destin d'Amélie Poulain",
        "plot": "Despite being caught in her imaginative world, Amelie, a young waitress, decides to help people find happiness. Her quest to spread joy leads her on a journey where she finds true love.",
        "year": "2001"
    },
    {
        "id": "tt0067093",
        "name": "Fiddler on the Roof",
        "plot": "In pre-revolutionary Russia, a Jewish peasant with traditional values contends with marrying off three of his daughters with modern romantic ideals while growing anti-Semitic sentiment threatens his village.",
        "year": "1971"
    },
    {
        "id": "tt1345836",
        "name": "The Dark Knight Rises",
        "plot": "Eight years after the Joker's reign of chaos, Batman is coerced out of exile with the assistance of the mysterious Selina Kyle in order to defend Gotham City from the vicious guerrilla terrorist Bane.",
        "year": "2012"
    },
    {
        "id": "tt0054997",
        "name": "The Hustler",
        "plot": "An up-and-coming pool player plays a long-time champion in a single high-stakes match.",
        "year": "1961"
    },
    {
        "id": "tt0019254",
        "name": "La passion de Jeanne d'Arc",
        "plot": "In 1431, Jeanne d'Arc is placed on trial on charges of heresy. The ecclesiastical jurists attempt to force Jeanne to recant her claims of holy visions.",
        "year": "1928"
    },
    {
        "id": "tt0172495",
        "name": "Gladiator",
        "plot": "A former Roman General sets out to exact vengeance against the corrupt emperor who murdered his family and sent him into slavery.",
        "year": "2000"
    },
    {
        "id": "tt0107688",
        "name": "The Nightmare Before Christmas",
        "plot": "Jack Skellington, king of Halloween Town, discovers Christmas Town, but his attempts to bring Christmas to his home causes confusion.",
        "year": "1993"
    },
    {
        "id": "tt4169250",
        "name": "M.S. Dhoni: The Untold Stor",
        "plot": "The untold story of Mahendra Singh Dhoni's journey from ticket collector to trophy collector - the world-cup-winning captain of the Indian Cricket Team.",
        "year": "2016"
    },
    {
        "id": "tt0053946",
        "name": "Inherit the Wind",
        "plot": "Based on a real-life case in 1925, two great lawyers argue the case for and against a Tennessee science teacher accused of the crime of teaching evolution.",
        "year": "1960"
    },
    {
        "id": "tt0090605",
        "name": "Alien 2",
        "plot": "Decades after surviving the Nostromo incident, Ellen Ripley is sent out to re-establish contact with a terraforming colony but finds herself battling the Alien Queen and her offspring.",
        "year": "1986"
    },
    {
        "id": "tt0012349",
        "name": "The Kid",
        "plot": "The Tramp cares for an abandoned child, but events put their relationship in jeopardy.",
        "year": "1921"
    },
    {
        "id": "tt0080455",
        "name": "The Blues Brothers",
        "plot": "Jake Blues rejoins with his brother Elwood after being released from prison, but the duo has just days to reunite their old R&B band and save the Catholic home where the two were raised, outrunning the police as they tear through Chicago.",
        "year": "1980"
    },
    {
        "id": "tt0209144",
        "name": "Memento",
        "plot": "A man with short-term memory loss attempts to track down his wife's murderer.",
        "year": "2000"
    },
    {
        "id": "tt9052870",
        "name": "Chhichhore",
        "plot": "A tragic incident forces Anirudh, a middle-aged man, to take a trip down memory lane and reminisce his college days along with his friends, who were labelled as losers.",
        "year": "2019"
    },
    {
        "id": "tt1504320",
        "name": "The King's Speech",
        "plot": "The story of King George VI, his unexpected ascension to the throne of the British Empire in 1936, and the speech therapist who helped the unsure monarch overcome his stammer.",
        "year": "2010"
    },
    {
        "id": "tt1125849",
        "name": "The Wrestler",
        "plot": "A faded professional wrestler must retire, but finds his quest for a new life outside the ring a dispiriting struggle.",
        "year": "2008"
    },
    {
        "id": "tt0070735",
        "name": "The Sting",
        "plot": "Two grifters team up to pull off the ultimate con.",
        "year": "1973"
    },
    {
        "id": "tt0476735",
        "name": "My Father and My Son",
        "plot": "The family of a left-wing journalist is torn apart after the military coup of Turkey in 1980.",
        "year": "2005"
    },
    {
        "id": "tt23289160",
        "name": "Godzilla Minus One",
        "plot": "Post war Japan is at its lowest point when a new crisis emerges in the form of a giant monster, baptized in the horrific power of the atomic bomb.",
        "year": "2023"
    },
    {
        "id": "tt0168629",
        "name": "Dancer in the Dark",
        "plot": "An Eastern European US immigrant with a love for musicals has to cope with the gradual loss of her vision.",
        "year": "2000"
    },
    {
        "id": "tt0091251",
        "name": "Idi I Smotri",
        "plot": "After finding an old rifle, a young boy joins the Soviet resistance movement against ruthless German forces and experiences the horrors of World War II.",
        "year": "1985"
    },
    {
        "id": "tt0031381",
        "name": "Gone with the Wind",
        "plot": "A sheltered and manipulative Southern belle and a roguish profiteer face off in a turbulent romance as the society around them crumbles with the end of slavery and is rebuilt during the Civil War and Reconstruction periods.",
        "year": "1939"
    },
    {
        "id": "tt0102138",
        "name": "JFK",
        "plot": "New Orleans District Attorney Jim Garrison discovers there's more to the Kennedy assassination than the official story.",
        "year": "1991"
    },
    {
        "id": "tt0210945",
        "name": "Remember the Titans",
        "plot": "The true story of a newly appointed African-American coach and his high school team on their first season as a racially integrated unit.",
        "year": "2000"
    },
    {
        "id": "tt0347304",
        "name": "Kal Ho Naa Ho",
        "plot": "Naina, an introverted, perpetually depressed girl's life changes when she meets Aman. But Aman has a secret of his own which changes their lives forever. Embroiled in all this is Rohit, Naina's best friend who conceals his love for her.",
        "year": "2003"
    },
    {
        "id": "tt0082971",
        "name": "Raiders of the Lost Ark",
        "plot": "In 1936, archaeologist and adventurer Indiana Jones is hired by the U.S. government to find the Ark of the Covenant before the Nazis can obtain its awesome powers.",
        "year": "1981"
    },
    {
        "id": "tt0051201",
        "name": "Witness for the Prosecution",
        "plot": "A veteran British barrister must defend his client in a murder trial that has surprise after surprise.",
        "year": "1957"
    },
    {
        "id": "tt0083987",
        "name": "Gandhi",
        "plot": "The life of the lawyer who became the famed leader of the Indian revolts against the British rule through his philosophy of nonviolent protest.",
        "year": "1982"
    },
    {
        "id": "tt0053291",
        "name": "Some Like It Hot",
        "plot": "After two male musicians witness a mob hit, they flee the state in an all-female band disguised as women, but further complications set in.",
        "year": "1959"
    },
    {
        "id": "tt0964517",
        "name": "The Fighter",
        "plot": "Based on the story of Micky Ward, a fledgling boxer who tries to escape the shadow of his more famous but troubled older boxing brother and get his own shot at greatness.",
        "year": "2010"
    },
    {
        "id": "tt0104940",
        "name": "The Muppet Christmas Carol",
        "plot": "The Muppets present their own touching rendition of Charles Dickens' classic tale.",
        "year": "1992"
    },
    {
        "id": "tt1305806",
        "name": "El Secreto De Sus Ojos",
        "plot": "A retired legal counselor writes a novel hoping to find closure for one of his past unresolved homicide cases and for his unreciprocated love with his superior - both of which still haunt him decades later.",
        "year": "2009"
    },
    {
        "id": "tt0808417",
        "name": "Persepolis",
        "plot": "A precocious and outspoken Iranian girl grows up during the Islamic Revolution.",
        "year": "2007"
    },
    {
        "id": "tt0405094",
        "name": "Das Leben der Anderen",
        "plot": "In 1984 East Berlin, an agent of the secret police, conducting surveillance on a writer and his lover, finds himself becoming increasingly absorbed by their lives.",
        "year": "2006"
    },
    {
        "id": "tt0993846",
        "name": "The Wolf of Wall Street",
        "plot": "Based on the true story of Jordan Belfort, from his rise to a wealthy stock-broker living the high life to his fall involving crime, corruption and the federal government.",
        "year": "2013"
    },
    {
        "id": "tt1201607",
        "name": "Harry Potter and the Deathly Hallows: Part 2",
        "plot": "Harry, Ron, and Hermione search for Voldemort's remaining Horcruxes in their effort to destroy the Dark Lord as the final battle rages on at Hogwarts.",
        "year": "2011"
    },
    {
        "id": "tt0067992",
        "name": "Willy Wonka & the Chocolate Factory",
        "plot": "A poor but hopeful boy seeks one of the five coveted golden tickets that will send him on a tour of Willy Wonka's mysterious chocolate factory.",
        "year": "1971"
    },
    {
        "id": "tt0108037",
        "name": "The Sandlot",
        "plot": "In the summer of 1962, a new kid in town is taken under the wing of a young baseball prodigy and his rowdy team, resulting in many adventures.",
        "year": "1993"
    },
    {
        "id": "tt4154796",
        "name": "Avengers: Endgame",
        "plot": "After the devastating events of Avengers: Infinity War (2018), the universe is in ruins. With the help of remaining allies, the Avengers assemble once more in order to reverse Thanos' actions and restore balance to the universe.",
        "year": "2019"
    },
    {
        "id": "tt0057565",
        "name": "Tengoku to Jigoku",
        "plot": "An executive of a Yokohama shoe company becomes a victim of extortion when his chauffeur's son is kidnapped by mistake and held for ransom.",
        "year": "1963"
    },
    {
        "id": "tt0078748",
        "name": "Alien",
        "plot": "The crew of a commercial spacecraft encounters a deadly lifeform after investigating an unknown transmission.",
        "year": "1979"
    },
    {
        "id": "tt0068646",
        "name": "The Godfather",
        "plot": "Don Vito Corleone, head of a mafia family, decides to hand over his empire to his youngest son Michael. However, his decision unintentionally puts the lives of his loved ones in grave danger.",
        "year": "1972"
    },
    {
        "id": "tt0412080",
        "name": "The World's Fastest Indian",
        "plot": "The story of New Zealander Burt Munro, who spent years rebuilding a 1920 Indian motorcycle, which helped him set the land speed world record at Utah's Bonneville Salt Flats in 1967.",
        "year": "2005"
    },
    {
        "id": "tt15097216",
        "name": "Jai Bhim",
        "plot": "When a tribal man is arrested for a case of alleged theft, his wife turns to a human-rights lawyer to help bring justice.",
        "year": "2021"
    },
    {
        "id": "tt0120815",
        "name": "Saving Private Ryan",
        "plot": "Following the Normandy Landings, a group of U.S. soldiers go behind enemy lines to retrieve a paratrooper whose brothers have been killed in action.",
        "year": "1998"
    },
    {
        "id": "tt0816692",
        "name": "Interstellar",
        "plot": "When Earth becomes uninhabitable in the future, a farmer and ex-NASA pilot, Joseph Cooper, is tasked to pilot a spacecraft, along with a team of researchers, to find a new planet for humans.",
        "year": "2014"
    },
    {
        "id": "tt0120689",
        "name": "The Green Mile",
        "plot": "A tale set on death row in a Southern jail, where gentle giant John possesses the mysterious power to heal people's ailments. When the lead guard, Paul, recognizes John's gift, he tries to help stave off the condemned man's execution.",
        "year": "1999"
    },
    {
        "id": "tt0071562",
        "name": "The Godfather: Part II",
        "plot": "The early life and career of Vito Corleone in 1920s New York City is portrayed, while his son, Michael, expands and tightens his grip on the family crime syndicate.",
        "year": "1974"
    },
    {
        "id": "tt0081505",
        "name": "The Shining",
        "plot": "A family heads to an isolated hotel for the winter where a sinister presence influences the father into violence, while his psychic son sees horrific forebodings from both past and future.",
        "year": "1980"
    },
    {
        "id": "tt0050083",
        "name": "12 Angry Men",
        "plot": "The jury in a New York City murder trial is frustrated by a single member whose skeptical caution forces them to more carefully consider the evidence before jumping to a hasty verdict.",
        "year": "1957"
    },
    {
        "id": "tt0084787",
        "name": "The Thing",
        "plot": "A research team in Antarctica is hunted by a shape-shifting alien that assumes the appearance of its victims.",
        "year": "1982"
    },
    {
        "id": "tt0110912",
        "name": "Pulp Fiction",
        "plot": "The lives of two mob hitmen, a boxer, a gangster and his wife, and a pair of diner bandits intertwine in four tales of violence and redemption.",
        "year": "1994"
    },
    {
        "id": "tt0253474",
        "name": "The Pianist",
        "plot": "During the WWII, acclaimed Polish musician Wladyslaw faces various struggles as he loses contact with his family. As the situation worsens, he hides in the ruins of Warsaw in order to survive.",
        "year": "2002"
    },
    {
        "id": "tt0060196",
        "name": "Il Buono, Il Brutto, Il Cattivo",
        "plot": "A bounty hunting scam joins two men in an uneasy alliance against a third in a race to find a fortune in gold buried in a remote cemetery.",
        "year": "1966"
    },
    {
        "id": "tt0099685",
        "name": "GoodFellas",
        "plot": "The story of Henry Hill and his life in the mafia, covering his relationship with his wife Karen and his mob partners Jimmy Conway and Tommy DeVito.",
        "year": "1990"
    },
    {
        "id": "tt0095327",
        "name": "Grave of the Fireflies",
        "plot": "A young boy and his little sister struggle to survive in Japan during World War II.",
        "year": "1988"
    },
    {
        "id": "tt8239946",
        "name": "Tumbbad",
        "plot": "A mythological story about a goddess who created the entire universe. The plot revolves around the consequences when humans build a temple for her first-born.",
        "year": "2018"
    },
    {
        "id": "tt0361748",
        "name": "Inglourious Basterds",
        "plot": "In Nazi-occupied France during World War II, a plan to assassinate Nazi leaders by a group of Jewish U.S. soldiers coincides with a theatre owner's vengeful plans for the same.",
        "year": "2009"
    },
    {
        "id": "tt0070047",
        "name": "The Exorcist",
        "plot": "When a young girl is possessed by a mysterious entity, her mother seeks the help of two Catholic priests to save her life.",
        "year": "1973"
    },
    {
        "id": "tt0078788",
        "name": "Apocalypse Now",
        "plot": "A U.S. Army officer serving in Vietnam is tasked with assassinating a renegade Special Forces Colonel who sees himself as a god.",
        "year": "1979"
    },
    {
        "id": "tt0046911",
        "name": "Les diaboliques",
        "plot": "The wife and mistress of a loathed school principal plan to murder him with what they believe is the perfect alibi.",
        "year": "1955"
    },
    {
        "id": "tt0063522",
        "name": "Rosemary's Baby",
        "plot": "A young couple trying for a baby moves into an aging, ornate apartment building on Central Park West, where they find themselves surrounded by peculiar neighbors.",
        "year": "1968"
    },
    {
        "id": "tt0056687",
        "name": "What Ever Happened to Baby Jane?",
        "plot": "A former child star torments her paraplegic sister in their decaying Hollywood mansion.",
        "year": "1962"
    },
    {
        "id": "tt0082096",
        "name": "Das Boot",
        "plot": "A German U-boat stalks the frigid waters of the North Atlantic as its young crew experience the sheer terror and claustrophobic life of a submariner in World War II.",
        "year": "1981"
    },
    {
        "id": "tt0010323",
        "name": "Das Cabinet des Dr. Caligari",
        "plot": "Hypnotist Dr. Caligari uses a somnambulist, Cesare, to commit murders.",
        "year": "1920"
    },
    {
        "id": "tt0317248",
        "name": "City of God",
        "plot": "In the slums of Rio, two kids' paths diverge as one struggles to become a photographer and the other a kingpin.",
        "year": "2002"
    },
    {
        "id": "tt0050825",
        "name": "Paths of Glory",
        "plot": "After refusing to attack an enemy position, a general accuses the soldiers of cowardice and their commanding officer must defend them.",
        "year": "1957"
    },
    {
        "id": "tt0365748",
        "name": "Shaun of the Dead",
        "plot": "The uneventful, aimless lives of a London electronics salesman and his layabout roommate are disrupted by the zombie apocalypse.",
        "year": "2004"
    },
    {
        "id": "tt0013442",
        "name": "Nosferatu",
        "plot": "Vampire Count Orlok expresses interest in a new residence and real estate agent Hutter's wife.",
        "year": "1922"
    },
    {
        "id": "tt0024216",
        "name": "King Kong",
        "plot": "A film crew goes to a tropical island for a location shoot, where they capture a colossal ape who takes a shine to their blonde starlet, and bring him back to New York City.",
        "year": "1933"
    },
    {
        "id": "tt0119698",
        "name": "Mononoke-hime",
        "plot": "On a journey to find the cure for a Tatarigami's curse, Ashitaka finds himself in the middle of a war between the forest gods and Tatara, a mining colony. In this quest he also meets San, the Mononoke Hime.",
        "year": "1997"
    },
    {
        "id": "tt5052448",
        "name": "Get Out",
        "plot": "A young African-American visits his white girlfriend's parents for the weekend, where his simmering uneasiness about their reception of him eventually reaches a boiling point.",
        "year": "2017"
    },
    {
        "id": "tt1255953",
        "name": "Incendies",
        "plot": "Twins journey to the Middle East to discover their family history and fulfill their mother's last wishes.",
        "year": "2010"
    },
    {
        "id": "tt0086190",
        "name": "Star Wars: Episode VI - Return of the Jedi",
        "plot": "After rescuing Han Solo from Jabba the Hutt, the Rebels attempt to destroy the second Death Star, while Luke struggles to help Darth Vader back from the dark side.",
        "year": "1983"
    },
    {
        "id": "tt0120586",
        "name": "American History X",
        "plot": "Living a life marked by violence, neo-Nazi Derek finally goes to prison after killing two black youths. Upon his release, Derek vows to change; he hopes to prevent his brother, Danny, who idolizes Derek, from following in his footsteps.",
        "year": "1998"
    },
    {
        "id": "tt4154756",
        "name": "Avengers: Infinity War",
        "plot": "The Avengers and their allies must be willing to sacrifice all in an attempt to defeat the powerful Thanos before his blitz of devastation and ruin puts an end to the universe.",
        "year": "2018"
    },
    {
        "id": "tt0093058",
        "name": "Full Metal Jacket",
        "plot": "A pragmatic U.S. Marine observes the dehumanizing effects the Vietnam War has on his fellow recruits from their brutal boot camp training to the bloody street fighting in Hue.",
        "year": "1987"
    },
    {
        "id": "tt0093773",
        "name": "Predator",
        "plot": "A team of commandos on a mission in a Central American jungle find themselves hunted by an extraterrestrial warrior.",
        "year": "1987"
    },
    {
        "id": "tt0056172",
        "name": "Lawrence of Arabia",
        "plot": "The story of T.E. Lawrence, the English officer who successfully united and led the diverse, often warring, Arab tribes during World War I in order to fight the Turks.",
        "year": "1962"
    },
    {
        "id": "tt1139797",
        "name": "Låt den rätte komma in",
        "plot": "Oskar, an overlooked and bullied boy, finds love and revenge through Eli, a beautiful but peculiar girl.",
        "year": "2008"
    },
    {
        "id": "tt0055031",
        "name": "Judgment at Nuremberg",
        "plot": "In 1948, an American court in occupied Germany tries four Nazis judged for war crimes.",
        "year": "1961"
    },
    {
        "id": "tt0077402",
        "name": "Dawn of the Dead",
        "plot": "During an escalating zombie epidemic, two Philadelphia SWAT team members, a traffic reporter and his TV executive girlfriend seek refuge in a secluded shopping mall.",
        "year": "1978"
    },
    {
        "id": "tt10872600",
        "name": "Spider-Man: No Way Home",
        "plot": "With Spider-Man's identity now revealed, Peter asks Doctor Strange for help. When a spell goes wrong, dangerous foes from other worlds start to appear, forcing Peter to discover what it truly means to be Spider-Man.",
        "year": "2021"
    },
    {
        "id": "tt0066921",
        "name": "A Clockwork Orange",
        "plot": "In the future, a sadistic gang leader is imprisoned and volunteers for a conduct-aversion experiment, but it doesn't go as planned.",
        "year": "1971"
    },
    {
        "id": "tt10295212",
        "name": "Shershaah",
        "plot": "Shershaah is the story of PVC awardee Indian soldier Capt. Vikram Batra, whose bravery and unflinching courage in chasing the Pakistani soldiers out of Indian territory contributed immensely in India finally winning the Kargil War in 1999.",
        "year": "2021"
    },
    {
        "id": "tt0062622",
        "name": "2001: A Space Odyssey",
        "plot": "After uncovering a mysterious artifact buried beneath the Lunar surface, a spacecraft is sent to Jupiter to find its origins: a spacecraft manned by two men and the supercomputer HAL 9000.",
        "year": "1968"
    },
    {
        "id": "tt0022913",
        "name": "Freaks",
        "plot": "A circus' beautiful trapeze artist agrees to marry the leader of side-show performers, but his deformed friends discover she is only marrying him for his inheritance.",
        "year": "1932"
    },
    {
        "id": "tt9900782",
        "name": "Kaithi",
        "plot": "Dilli, an ex-convict, endeavours to meet his daughter for the first time after leaving prison. However, his attempts are interrupted due to a drug raid planned by Inspector Bejoy.",
        "year": "2019"
    },
    {
        "id": "tt0457430",
        "name": "El Laberinto Del Fauno",
        "plot": "In the Falangist Spain of 1944, the bookish young stepdaughter of a sadistic army officer escapes into an eerie but captivating fantasy world.",
        "year": "2006"
    },
    {
        "id": "tt0053125",
        "name": "North by Northwest",
        "plot": "A New York City advertising executive goes on the run after being mistaken for a government agent by a group of foreign spies, and falls for a woman whose loyalties he begins to doubt.",
        "year": "1959"
    },
    {
        "id": "tt0063350",
        "name": "Night of the Living Dead",
        "plot": "A ragtag group of Pennsylvanians barricade themselves in an old farmhouse to remain safe from a horde of flesh-eating ghouls that are ravaging the Northeast of the United States.",
        "year": "1968"
    },
    {
        "id": "tt0043014",
        "name": "Sunset Blvd.",
        "plot": "A screenwriter develops a dangerous relationship with a faded film star determined to make a triumphant return.",
        "year": "1950"
    },
    {
        "id": "tt2582802",
        "name": "Whiplash",
        "plot": "A promising young drummer enrolls at a cut-throat music conservatory where his dreams of greatness are mentored by an instructor who will stop at nothing to realize a student's potential.",
        "year": "2014"
    },
    {
        "id": "tt0111161",
        "name": "The Shawshank Redemption",
        "plot": "Over the course of several years, two convicts form a friendship, seeking consolation and, eventually, redemption through basic compassion.",
        "year": "1994"
    },
    {
        "id": "tt0036775",
        "name": "Double Indemnity",
        "plot": "A Los Angeles insurance representative lets an alluring housewife seduce him into a scheme of insurance fraud and murder that arouses the suspicion of his colleague, an insurance investigator.",
        "year": "1944"
    },
    {
        "id": "tt23849204",
        "name": "12th Fail",
        "plot": "The real-life story of IPS Officer Manoj Kumar Sharma and IRS Officer Shraddha Joshi.",
        "year": "2023"
    },
    {
        "id": "tt1853728",
        "name": "Django Unchained",
        "plot": "With the help of a German bounty-hunter, a freed slave sets out to rescue his wife from a brutal plantation owner in Mississippi.",
        "year": "2012"
    },
    {
        "id": "tt0041959",
        "name": "The Third Man",
        "plot": "Pulp novelist Holly Martins travels to shadowy, postwar Vienna, only to find himself investigating the mysterious death of an old friend, Harry Lime.",
        "year": "1949"
    },
    {
        "id": "tt0086879",
        "name": "Amadeus",
        "plot": "The life, success and troubles of Wolfgang Amadeus Mozart, as told by Antonio Salieri, the contemporaneous composer who was deeply jealous of Mozart's talent and claimed to have murdered him.",
        "year": "1984"
    },
    {
        "id": "tt0064116",
        "name": "C'era Una Volta Il West",
        "plot": "A mysterious stranger with a harmonica joins forces with a notorious desperado to protect a beautiful widow from a ruthless assassin working for the railroad.",
        "year": "1968"
    },
    {
        "id": "tt0032976",
        "name": "Rebecca",
        "plot": "A self-conscious woman juggles adjusting to her new role as an aristocrat's wife and avoiding being intimidated by his first wife's spectral presence.",
        "year": "1940"
    },
    {
        "id": "tt0043338",
        "name": "Ace in the Hole",
        "plot": "A frustrated former big-city journalist now stuck working for an Albuquerque newspaper exploits a story about a man trapped in a cave to rekindle his career, but the situation quickly escalates into an out-of-control circus.",
        "year": "1951"
    },
    {
        "id": "tt0105695",
        "name": "Unforgiven",
        "plot": "Retired Old West gunslinger William Munny reluctantly takes on one last job, with the help of his old partner Ned Logan and a young man, The \"Schofield Kid.\"",
        "year": "1992"
    },
    {
        "id": "tt6966692",
        "name": "Green Book",
        "plot": "A working-class Italian-American bouncer becomes the driver for an African-American classical pianist on a tour of venues through the 1960s American South.",
        "year": "2018"
    },
    {
        "id": "tt0059578",
        "name": "Per qualche dollaro in più",
        "plot": "Two bounty hunters with the same intentions team up to track down an escaped Mexican outlaw.",
        "year": "1965"
    },
    {
        "id": "tt0042041",
        "name": "White Heat",
        "plot": "A psychopathic criminal with a mother complex makes a daring break from prison and leads his old gang in a chemical plant payroll heist.",
        "year": "1949"
    },
    {
        "id": "tt0033870",
        "name": "The Maltese Falcon",
        "plot": "San Francisco private detective Sam Spade takes on a case that involves him with three eccentric criminals, a gorgeous liar and their quest for a priceless statuette, with the stakes rising after his partner is murdered.",
        "year": "1941"
    },
    {
        "id": "tt0040897",
        "name": "The Treasure of the Sierra Madre",
        "plot": "Two down-on-their-luck Americans searching for work in 1920s Mexico convince an old prospector to help them mine for gold in the Sierra Madre Mountains.",
        "year": "1948"
    },
    {
        "id": "tt0040725",
        "name": "The Red Shoes",
        "plot": "A young ballet dancer is torn between the man she loves and her pursuit to become a prima ballerina.",
        "year": "1948"
    },
    {
        "id": "tt0056217",
        "name": "The Man Who Shot Liberty Valance",
        "plot": "A senator returns to a Western town for the funeral of an old friend and tells the story of his origins.",
        "year": "1962"
    },
    {
        "id": "tt0048424",
        "name": "The Night of the Hunter",
        "plot": "A self-proclaimed preacher marries a gullible widow whose young children are reluctant to tell him where their real dad hid the $10,000 he'd stolen in a robbery.",
        "year": "1955"
    },
    {
        "id": "tt0106332",
        "name": "Ba wang bie ji",
        "plot": "Two boys meet at an opera training school in Peking in 1924. Their resulting friendship will span nearly 70 years and endure some of the most troublesome times in China's history.",
        "year": "1992"
    },
    {
        "id": "tt0052311",
        "name": "Touch of Evil",
        "plot": "A stark, perverse story of murder, kidnapping and police corruption in a Mexican border town.",
        "year": "1958"
    },
    {
        "id": "tt0015864",
        "name": "The Gold Rush",
        "plot": "A prospector goes to the Klondike during the 1890s gold rush in hopes of making his fortune, and is smitten with a girl he sees in a dance hall.",
        "year": "1925"
    },
    {
        "id": "tt0039689",
        "name": "Build My Gallows High",
        "plot": "A private eye escapes his past to run a gas station in a small town, but his past catches up with him. Now he must return to the big city world of danger, corruption, double crosses, and duplicitous dames.",
        "year": "1947"
    },
    {
        "id": "tt0077711",
        "name": "Höstsonaten",
        "plot": "A devoted wife is visited by her mother, a successful concert pianist who had little time for her when she was young.",
        "year": "1978"
    },
    {
        "id": "tt1663202",
        "name": "The Revenant",
        "plot": "A frontiersman on a fur trading expedition in the 1820s fights for survival after being mauled by a bear and left for dead by members of his own hunting team.",
        "year": "2015"
    },
    {
        "id": "tt0051036",
        "name": "Sweet Smell of Success",
        "plot": "Powerful but unethical Broadway columnist J.J. Hunsecker coerces unscrupulous press agent Sidney Falco into breaking up his sister's romance with a jazz musician.",
        "year": "1957"
    },
    {
        "id": "tt0099348",
        "name": "Dances with Wolves",
        "plot": "Lieutenant John Dunbar, assigned to a remote western Civil War outpost, finds himself engaging with a neighbouring Sioux settlement, causing him to question his own purpose.",
        "year": "1990"
    },
    {
        "id": "tt0038355",
        "name": "The Big Sleep",
        "plot": "Private detective Philip Marlowe is hired by a wealthy family. Before the complex case is over, he's seen murder, blackmail and what might be love.",
        "year": "1946"
    },
    {
        "id": "tt10366460",
        "name": "CODA",
        "plot": "As a CODA (Child of Deaf Adults) Ruby is the only hearing person in her deaf family. When the family's fishing business is threatened, Ruby finds herself torn between pursuing her passion at Berklee College of Music and her fear of abandoning her parents.",
        "year": "2021"
    },
    {
        "id": "tt0137523",
        "name": "Fight Club",
        "plot": "An insomniac office worker and a devil-may-care soap maker form an underground fight club that evolves into much more.",
        "year": "1999"
    },
    {
        "id": "tt0053221",
        "name": "Rio Bravo",
        "plot": "A small-town sheriff in the American West enlists the help of a disabled man, a drunk, and a young gunfighter in his efforts to hold in jail the brother of the local bad guy.",
        "year": "1959"
    },
    {
        "id": "tt0044079",
        "name": "Strangers on a Train",
        "plot": "A psychopathic man tries to forcibly persuade a tennis star to agree to his theory that two strangers can get away with murder by submitting to his plan to kill the other's most-hated person.",
        "year": "1951"
    },
    {
        "id": "tt2948372",
        "name": "Soul",
        "plot": "After landing the gig of a lifetime, a New York jazz pianist suddenly finds himself trapped in a strange land between Earth and the afterlife.",
        "year": "2020"
    },
    {
        "id": "tt0038787",
        "name": "Notorious",
        "plot": "The daughter of a convicted Nazi spy is asked by American agents to gather information on a ring of Nazi scientists in South America. How far will she have to go to ingratiate herself with them?",
        "year": "1946"
    },
    {
        "id": "tt0064115",
        "name": "Butch Cassidy and the Sundance Kid",
        "plot": "In 1890s Wyoming, Butch Cassidy and The Sundance Kid lead a band of outlaws. When a train robbery goes wrong, they find themselves on the run with a posse hard on their heels. After considering their options, they escape to South America.",
        "year": "1969"
    },
    {
        "id": "tt0084503",
        "name": "Pink Floyd: The Wall",
        "plot": "A confined but troubled rock star descends into madness in the midst of his physical and social isolation from everyone.",
        "year": "1982"
    },
    {
        "id": "tt0044706",
        "name": "High Noon",
        "plot": "A town Marshal, despite the disagreements of his newlywed bride and the townspeople around him, must face a gang of deadly killers alone at \"high noon\" when the gang leader, an outlaw he \"sent up\" years ago, arrives on the noon train.",
        "year": "1952"
    },
    {
        "id": "tt0049406",
        "name": "The Killing",
        "plot": "Crook Johnny Clay assembles a five-man team to plan and execute a daring racetrack robbery.",
        "year": "1956"
    },
    {
        "id": "tt0120731",
        "name": "La Leggenda Del Pianista Sull'oceano",
        "plot": "A baby boy discovered on an ocean liner in 1900 grows into a musical prodigy, never setting foot on land.",
        "year": "1998"
    },
    {
        "id": "tt11032374",
        "name": "Demon Slayer: Mugen Train",
        "plot": "After his family was brutally murdered and his sister turned into a demon, Tanjiro Kamado's journey as a demon slayer began. Tanjiro and his comrades embark on a new mission aboard the Mugen Train, on track to despair.",
        "year": "2020"
    },
    {
        "id": "tt0037008",
        "name": "Laura",
        "plot": "A police detective falls in love with the woman whose murder he is investigating.",
        "year": "1944"
    },
    {
        "id": "tt0058461",
        "name": "A Fistful of Dollars",
        "plot": "A wandering gunfighter plays two rival families against each other in a town torn apart by greed, pride, and revenge.",
        "year": "1964"
    },
    {
        "id": "tt0181875",
        "name": "Almost Famous",
        "plot": "A high-school boy in the early 1970s is given the chance to write a story for Rolling Stone magazine about an up-and-coming rock band as he accompanies them on their concert tour.",
        "year": "2000"
    },
    {
        "id": "tt2096673",
        "name": "Inside Out",
        "plot": "After young Riley is uprooted from her Midwest life and moved to San Francisco, her emotions - Joy, Fear, Anger, Disgust and Sadness - conflict on how best to navigate a new city, house, and school.",
        "year": "2015"
    },
    {
        "id": "tt0042593",
        "name": "In a Lonely Place",
        "plot": "A potentially violent screenwriter is a murder suspect until his lovely neighbor clears him. However, she soon starts to have her doubts.",
        "year": "1950"
    },
    {
        "id": "tt0065214",
        "name": "The Wild Bunch",
        "plot": "An aging group of outlaws look for one last big score as the \"traditional\" American West is disappearing around them.",
        "year": "1969"
    },
    {
        "id": "tt0382932",
        "name": "Ratatouille",
        "plot": "A rat who can cook makes an unusual alliance with a young kitchen worker at a famous Paris restaurant.",
        "year": "2007"
    },
    {
        "id": "tt1727824",
        "name": "Bohemian Rhapsody",
        "plot": "The story of the legendary British rock band Queen and lead singer Freddie Mercury, leading up to their famous performance at Live Aid (1985).",
        "year": "2018"
    },
    {
        "id": "tt0073486",
        "name": "One Flew Over the Cuckoo's Nest",
        "plot": "In the Fall of 1963, a Korean War veteran and criminal pleads insanity and is admitted to a mental institution, where he rallies up the scared patients against the tyrannical nurse.",
        "year": "1975"
    },
    {
        "id": "tt0037913",
        "name": "Mildred Pierce",
        "plot": "A hard-working mother inches towards disaster as she divorces her husband and starts a successful restaurant business to support her spoiled daughter.",
        "year": "1945"
    },
    {
        "id": "tt0892769",
        "name": "How to Train Your Dragon",
        "plot": "A hapless young Viking who aspires to hunt dragons becomes the unlikely friend of a young dragon himself, and learns there may be more to the creatures than he assumed.",
        "year": "2010"
    },
    {
        "id": "tt5537002",
        "name": "Killers of the Flower Moon",
        "plot": "When oil is discovered in 1920s Oklahoma under Osage Nation land, the Osage people are murdered one by one - until the FBI steps in to unravel the mystery.",
        "year": "2023"
    },
    {
        "id": "tt0045555",
        "name": "The Big Heat",
        "plot": "Tough cop Dave Bannion takes on a politically powerful crime syndicate.",
        "year": "1953"
    },
    {
        "id": "tt0198781",
        "name": "Monsters, Inc.",
        "plot": "In order to power the city, monsters have to scare children so that they scream. However, the children are toxic to the monsters, and after a child gets through, two monsters realize things may not be what they think.",
        "year": "2001"
    },
    {
        "id": "tt0088258",
        "name": "Spinal Tap",
        "plot": "Spinal Tap, one of England's loudest bands, is chronicled by film director Marty DiBergi on what proves to be a fateful tour.",
        "year": "1984"
    },
    {
        "id": "tt9263550",
        "name": "Rocketry: The Nambi Effect",
        "plot": "The story of Indian Space Research Organization scientist Nambi Narayanan, who was framed for being a spy and arrested in 1994.",
        "year": "2022"
    },
    {
        "id": "tt0108358",
        "name": "Tombstone",
        "plot": "A successful lawman's plans to retire anonymously in Tombstone, Arizona are disrupted by the kind of outlaws he was famous for eliminating.",
        "year": "1993"
    },
    {
        "id": "tt0037884",
        "name": "The Lost Weekend",
        "plot": "The desperate life of a chronic alcoholic is followed through a four-day drinking bout.",
        "year": "1945"
    },
    {
        "id": "tt3544112",
        "name": "Sing Street",
        "plot": "A boy growing up in Dublin during the 1980s escapes his strained family life by starting a band to impress the mysterious girl he likes.",
        "year": "2016"
    },
    {
        "id": "tt3460252",
        "name": "The Hateful Eight",
        "plot": "In the dead of a Wyoming winter, a bounty hunter and his prisoner find shelter in a cabin currently inhabited by a collection of nefarious characters.",
        "year": "2015"
    },
    {
        "id": "tt0075029",
        "name": "The Outlaw: Josey Wales",
        "plot": "Missouri farmer Josey Wales joins a Confederate guerrilla unit and winds up on the run from the Union soldiers who murdered his family.",
        "year": "1976"
    },
    {
        "id": "tt0108394",
        "name": "Trois Couleurs: Bleu",
        "plot": "A woman struggles to find a way to live her life after the death of her husband and child.",
        "year": "1993"
    },
    {
        "id": "tt0268978",
        "name": "A Beautiful Mind",
        "plot": "After John Nash, a brilliant but asocial mathematician, accepts secret work in cryptography, his life takes a turn for the nightmarish.",
        "year": "2001"
    },
    {
        "id": "tt0080678",
        "name": "The Elephant Man",
        "plot": "A Victorian surgeon rescues a heavily disfigured man who is mistreated while scraping a living as a side-show freak. Behind his monstrous façade, there is revealed a person of kindness, intelligence and sophistication.",
        "year": "1980"
    }
]